In [1]:
import pandas as pd

De todo esto, nos damos cuenta que solo tenemos que limpiar algunas de las columnas, en concreto age, species, country, fatal, year, sex. Si reducimos esto a una tabla para saber que tenemos ya limpito y que no:

Entre las tareas que tendr√©is que hacer hoy:
- Al empezar a trabajar con este dataframe ya eliminamos algunas columnas que a priori no nos interesaban. Ahora llega el momento de eliminar alguna columna m√°s. En este caso vamos tendr√©is que eliminar las columnas que no nos sean √∫tiles para contestar a nuestras preguntas. Pero ojo ‚ö†Ô∏è, haced una copia del dataframe para no "cargarnos" el dataframe original y perder la info.
- ¬øHay valores duplicados en nuestro dataframe? En caso de que los haya, elimin√°ndolos.
- Como hemos visto, algunas columnas no tienen el tipo de datos que deber√≠an. Cambiad el tipo de dato para la columna de year.
- En la columna de country poner todos los valores en min√∫sculas.
- üí° Pista Tendr√©is que usar una funci√≥n o una lambda üí°
- Guardamos el csv para seguir trabajando en el siguiente ejercicio de pair de limpieza.

In [2]:
#Cargamos nuestro DataFrame
df_original=pd.read_csv('../EDA/datos/attack_eda1.csv',index_col=0)

In [3]:
df_original.head()

,case_number,year,type,country,area,location,activity,name,age,time,species_,href,unnamed:_0_y,injury,date,mes,fatal_,sex2
0,1800.00.00,1800.0,Unprovoked,SEYCHELLES,St. Anne,NaN,a corsair's boat was overturned,NaN,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,6116,"FATAL, all onboard were killed by sharks",1800,NaN,y,F
1,1797.05.28.R,1797.0,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,6117,FATAL,Reported May-28-1797,May,y,NaN
2,1792.09.12,1792.0,Provoked,ENGLAND,NaN,On the Thames River,Fishing,male,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,6118,"FATAL, PROVOKED INCIDENT",12-Sep-1792,Sep,y,M
3,1791.00.00,1791.0,Unprovoked,AUSTRALIA,New South Wales,Port Jackson,NaN,"female, an Australian aboriginal",NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,6119,"FATAL, ""bitten in two""",1791,NaN,y,F
4,1788.05.10,1788.0,Boat,AUSTRALIA,New South Wales,Sydney Harbor,Fishing,boat,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,6120,"No injury to occupants, shark bit oar and rudder",10-May-1788,May,n,NaN

EJERCICIO 1: Al empezar a trabajar con este dataframe ya eliminamos algunas columnas que a priori no nos interesaban. Ahora llega el momento de eliminar alguna columna m√°s. En este caso vamos tendr√©is que eliminar las columnas que no nos sean √∫tiles para contestar a nuestras preguntas. Pero ojo ‚ö†Ô∏è, haced una copia del dataframe para no "cargarnos" el dataframe original y perder la info.

In [4]:
df=df_original.copy()

In [5]:
df.head(2)

,case_number,year,type,country,area,location,activity,name,age,time,species_,href,unnamed:_0_y,injury,date,mes,fatal_,sex2
0,1800.00.00,1800.0,Unprovoked,SEYCHELLES,St. Anne,NaN,a corsair's boat was overturned,NaN,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,6116,"FATAL, all onboard were killed by sharks",1800,NaN,y,F
1,1797.05.28.R,1797.0,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,6117,FATAL,Reported May-28-1797,May,y,NaN

In [6]:
df.columns

Index(['case_number', 'year', 'type', 'country', 'area', 'location',
       'activity', 'name', 'age', 'time', 'species_', 'href', 'unnamed:_0_y',
       'injury', 'date', 'mes', 'fatal_', 'sex2'],
      dtype='object')

In [7]:
df.drop(["location","area","name","href","injury","date","unnamed:_0_y"], axis=1, inplace=True)

In [8]:
df.head(2)

,case_number,year,type,country,activity,age,time,species_,mes,fatal_,sex2
0,1800.00.00,1800.0,Unprovoked,SEYCHELLES,a corsair's boat was overturned,NaN,NaN,NaN,NaN,y,F
1,1797.05.28.R,1797.0,Unprovoked,NaN,Dropped overboard,NaN,NaN,NaN,May,y,NaN

EJERCICIO 2: ¬øHay valores duplicados en nuestro dataframe? En caso de que los haya, elimin√°ndolos.

In [9]:
df.duplicated().sum()

0

EJERCICIO 3: Como hemos visto, algunas columnas no tienen el tipo de datos que deber√≠an. Cambiad el tipo de dato para la columna de year.

In [10]:
df.dtypes

case_number     object
year           float64
type            object
country         object
activity        object
age             object
time            object
species_        object
mes             object
fatal_          object
sex2            object
dtype: object

In [11]:
df=df.astype({"year":"Int64"})

In [12]:
df=df.astype({"country":"object"})

In [13]:
df.dtypes

case_number    object
year            Int64
type           object
country        object
activity       object
age            object
time           object
species_       object
mes            object
fatal_         object
sex2           object
dtype: object

In [14]:
df.head()

,case_number,year,type,country,activity,age,time,species_,mes,fatal_,sex2
0,1800.00.00,1800,Unprovoked,SEYCHELLES,a corsair's boat was overturned,NaN,NaN,NaN,NaN,y,F
1,1797.05.28.R,1797,Unprovoked,NaN,Dropped overboard,NaN,NaN,NaN,May,y,NaN
2,1792.09.12,1792,Provoked,ENGLAND,Fishing,NaN,NaN,NaN,Sep,y,M
3,1791.00.00,1791,Unprovoked,AUSTRALIA,NaN,NaN,NaN,NaN,NaN,y,F
4,1788.05.10,1788,Boat,AUSTRALIA,Fishing,NaN,NaN,NaN,May,n,NaN

In [15]:
df.dtypes

case_number    object
year            Int64
type           object
country        object
activity       object
age            object
time           object
species_       object
mes            object
fatal_         object
sex2           object
dtype: object

EJERCICIO 4: En la columna de country poner todos los valores en min√∫sculas.

üí° Pista Tendr√©is que usar una funci√≥n o una lambda üí°

In [16]:
def minuscula(col):
    try: 
        col=col.lower()
        return col
    except:
        pass

In [17]:
df["country"]=df["country"].apply(minuscula)

In [18]:
df.head()

,case_number,year,type,country,activity,age,time,species_,mes,fatal_,sex2
0,1800.00.00,1800,Unprovoked,seychelles,a corsair's boat was overturned,NaN,NaN,NaN,NaN,y,F
1,1797.05.28.R,1797,Unprovoked,None,Dropped overboard,NaN,NaN,NaN,May,y,NaN
2,1792.09.12,1792,Provoked,england,Fishing,NaN,NaN,NaN,Sep,y,M
3,1791.00.00,1791,Unprovoked,australia,NaN,NaN,NaN,NaN,NaN,y,F
4,1788.05.10,1788,Boat,australia,Fishing,NaN,NaN,NaN,May,n,NaN

EJERCICIO 5: Guardamos el csv para seguir trabajando en el siguiente ejercicio de pair de limpieza.

In [19]:
df.to_csv('../EDA/datos/attack_limpieza1.csv')